import { motion } from "framer-motion";

const about = {
	heading: "О нас",
	description: [
		"Мы — команда музыкантов, открывшая магазин в Митино, чтобы быть ближе к тем, кто любит музыку. С 2010 года мы не просто продаём, настраиваем и ремонтируем инструменты — мы делаем это с душой и вниманием к каждому клиенту.",
		"Здесь вы найдёте не только новые музыкальные инструменты, но и сможете починить свой. В нашем магазине есть мастерская по ремонту струнных музыкальных инструментов. Мы тщательно настраиваем все поступающие гитары, укулеле и другие струнные инструменты, доводя их до максимально удобного состояния для игры.",
		"Это особенно важно для бюджетных гитар, которые часто приходят с фабрики в неудобном состоянии: струны высоко, лады перекрывают друг друга и дребезжат. Мы приводим их в идеальное состояние, и после нашей доводки даже недорогие инструменты становятся такими же удобными, как дорогие.",
		"У нас можно не только купить инструмент, но и получить честный совет, помощь в выборе и поддержку после покупки. Мы понимаем, как важно, чтобы ваш инструмент звучал и играл наилучшим образом. Это наша работа — делать музыку доступной и удобной для всех."
	]
}

const About = () => {
	return (
		<section id="about">
			<div className="about">
				<div className="container">
					<motion.div 
						className="content"
						initial={{ opacity: 0 }}
						whileInView={{ opacity: 1 }}
						transition={{ duration: 1, ease: 'easeOut' }}
						viewport={{ once: true, amount: 0.3 }}
					>
						<h2>{about.heading}</h2>
						{about.description.map((item, index) => 
							<p key={index}>
								{item}
							</p>
						)}
					</motion.div>
				</div>
			</div>
		</section>
	)
}

export default About