import React from "react";

interface RepairListModalProps {
	isOpen: boolean;
	onClose: () => void;
}

const repairItems: string[] = [
	"Подгонка верхнего порожка 6-струнной гитары — 900\u00a0₽ (12-струнной — 1700\u00a0₽, укулеле — 600\u00a0₽)",
	"Подгонка нижнего порожка 6-струнной гитары — 600\u00a0₽ (12-струнной — 800\u00a0₽, укулеле\u00a0—\u00a0400\u00a0₽)",
	"Торцовка ладов гитары: общая — 400\u00a0₽, каждого лада надфилем — 800\u00a0₽ (укулеле\u00a0—\u00a0300\u00a0₽, 600\u00a0₽)",
	"Шлифовка ладов грифа гитары с закаткой — 1500\u00a0₽ (укулеле\u00a0—\u00a0800\u00a0₽)",
	"Полировка ладов грифа гитары - 1000\u00a0₽ (укулеле — 500\u00a0₽)",
	"Простая склейка головки грифа (косой слом) — 2000\u00a0₽",
	"Сложная склейка головки грифа с фрезеровкой и вставкой (прямой слом) — 8000\u00a0₽",
	"Склейка пятки грифа — 2000\u00a0₽",
	"Склейка деки с обечайкой: до 10см — 1000\u00a0₽, 10-30см — 2000\u00a0₽, >30см\u00a0—\u00a03000\u00a0₽",
	"Переклейка, восстановление канта гитары: до 10см — 1500\u00a0₽, 10-30см — 2500\u00a0₽, >30см\u00a0—\u00a04000\u00a0₽",
	"Склейка струнодержателя: прямоугольный — 3300\u00a0₽, фигурный — 3800\u00a0₽, 12стр\u00a0—\u00a04200\u00a0₽, укул.\u00a0—\u00a02000\u00a0₽",
	"Подклейка площадки под верхнюю деку — 1500\u00a0₽",
	"Приклеить пружину - 1000\u00a0₽ (ниже струнодержателя — 1800\u00a0₽)",
	"Проклейка трещины деки с установкой заплатки: до 10см — 1000\u00a0₽, 10-20см\u00a0—\u00a01500\u00a0₽, >20см\u00a0—\u00a02000\u00a0₽",
	"Замена колков 6-струнной гитары — 1200\u00a0₽ (12-струнной гитары — 2000\u00a0₽, укулеле\u00a0—\u00a0800\u00a0₽)",
	"Замена одного колка — 300\u00a0₽ (ремонт колка — 400\u00a0₽)",
	"Замена струн 6-струнной гитары — 800\u00a0₽ (12-струнной — 1500\u00a0₽, укулеле — 600\u00a0₽, скрипки\u00a0—\u00a0800\u00a0₽)",
	"Замена одной струны — 200\u00a0₽",
	"Замена ладов — 8000\u00a0₽, Замена одного лада — 600\u00a0₽",
	"Подгонка подставки скрипки — 1000\u00a0₽",
	"Установка распорки скрипки — 1000\u00a0₽",
	"Регулировка анкера - 200\u00a0₽ (с крышкой — 300\u00a0₽, со снятием грифа — 800\u00a0₽)",
	"Отстройка пружин электрогитары — 500\u00a0₽ (Floyd Rose — 1000\u00a0₽)",
	"Отстройка мензуры электрогитары — 1000\u00a0₽ (Floyd Rose — 2000\u00a0₽)",
	"Отстройка высоты струн электрогитары — 800\u00a0₽ (Les Paul — 300\u00a0₽)",
	"Выравнивание посадки грифа электрогитары — 1500\u00a0₽",
	"Диагностика проводки электрогитары — 1000\u00a0₽",
	"Замена или перепайка потенциометра, переключателя — 1500\u00a0₽",
	"Замена датчика без фрезеровочных работ — 1500\u00a0₽, с фрезеровкой\u00a0—\u00a03000\u00a0₽",
	"Экранирование электрогитары с помощью металлического скотча — 1500\u00a0₽",
	"Установка крепления ремня – 300\u00a0₽ за каждое",
	"Чистка грифа гитары с пропиткой лимонным маслом — 600\u00a0₽",
	"Чистка корпуса гитары — 600\u00a0₽",
	"Пайка одного провода — 500\u00a0₽",
	"Замена или перепайка гнезда — 1200\u00a0₽",
	"Установка пъезодатчика без эквалайзера — 2000\u00a0₽ (с одним блочком — 3000\u00a0₽, с двумя\u00a0—\u00a04000\u00a0₽, трансакустического — 5000\u00a0₽)",
	"Выравнивание грифа с помощью 2х недельной сушки под струбцинами — 1800\u00a0₽",
	"Косметические ремонтные работы оцениваются индивидуально"
];

const RepairListModal: React.FC<RepairListModalProps> = ({ isOpen, onClose }) => {
	if (!isOpen) return null;

	return (
		<div className="modal-overlay" onClick={onClose}>
			<div className="modal repair-modal" onClick={(e) => e.stopPropagation()}>
				<h3>Цены на ремонт</h3>
				<ul className="repair-price-list">
					{repairItems.map((item, index) => (
						<li key={index}>
							<p>{item}</p>
						</li>
					))}
				</ul>
				<button
					type="button"
					className="close-btn" 
					onClick={onClose}>
						Закрыть
				</button>
			</div>
		</div>
	);
};

export default RepairListModal;
